<template>
  <div class="reviews__inner">
    <div class="reviews__block">
      <div
        class="reviews__text"
        v-for="item in reviews"
        :key="item.id"
      >
        <ReviewBlock :item="item" />
      </div>
    </div>
  </div>
</template>

<script>
import TitlePage from "@/components/TitlePage.vue";
import ReviewBlock from "@/components/ReviewBlock.vue";
import ImageMan from "../assets/images/content-images/avatars/man.jpg";
import ImageWoman from "../assets/images/content-images/avatars/woman.jpg";

export default {
  name: "ModulesSection",
  components: {
    TitlePage,
    ReviewBlock,
  },
  data: function () {
    return {
      reviews: [
        {
          name: "Настя, всё было замечательно! Познавательно, увлекательно, в хорошей дружелюбной атмосфере. Отличное введение в мир бердвотчинга. Учитель - настоящий профессионал своего дела. Я под впечатлением! Приятно было познакомиться с другими школьниками. Отдельное спасибо Анатолию за мужскую компанию)",
          id: 1,
          image: ImageMan,
        },
        {
          name: "Спасибо и вам Анастасия за то что ввели нас в ряды бердвочеров. Каждую лекцию было интересно слушать, не менее интересно было отвечать на вопросы и набирать опыт в определении птиц нашей страны. На экскурсии я увидела птиц, которых думала никогда не увижу, но благодаря нашему учителю дубонос и крапивник попались мне на обозрение. Спасибо вам ещё раз)",
          id: 2,
          image: ImageWoman,
        },
        {
          name: "Здравствуйте всем! Присоединяюсь к словам Александра. Все было интересно и полезно. Пусть мы не узнаем некоторых птиц в лицо, но знаем теперь об их существовании! Настя молодец💚!",
          id: 3,
          image: ImageWoman,
        },
        {
          name: "Огромное спасибо за такую замечательную возможность узнать так много нового о птицах Беларуси! Презентации очень наглядные. Настя просто молодец!!! Слушать было очень интересно. За этот месяц я увидела и научилась распознавать чуть ли не больше местных птиц, чем за всю предыдущую жизнь))",
          id: 4,
          image: ImageWoman,
        },
        {
          name: "Все прошло замечательно и в теории и на полевых занятих. Настя, вы многому нас научили. Спасибо большое.",
          id: 5,
          image: ImageMan,
        },
        { name: "Настя, я также хотела вас поблагодарить 💙 За высокий уровень подготовки материала, интересную подачу и тот новый мир, который вы приоткрыли для нас 🦉 Не смотря на то, что не могла регулярно посещать занятия, получила мощный мотивационный заряд, исследовать и наблюдать за нашими пернатыми братьями.", id: 6, image: ImageWoman },
        { name: "Мне очень понравилось. Несмотря на то, что у меня не получилось посетить все занятия и, в принципе, уже немного знала птиц, на каждом занятии я узнавала что-то новое. Настя, ты прекрасный преподаватель, слушать твои лекции одно удовольствие, всегда было жаль, что время подходит к концу) Я очень надеюсь, что такое мероприятие не в последний раз, это было круто и очень интересно! Также большое спасибо за отличную компанию и дружескую атмосферу остальным студентам!", id: 7, image: ImageWoman }
      ],
      ImageMan,
      ImageWoman,
    };
  },
};
</script>

<style lang="scss">
@import "../assets/styles/_variables.scss";
.reviews__inner {
  margin-top: 50px;
}
.reviews__text {

  div {
    display: flex;
    align-items: center;
    justify-content: space-between;
    width: 70%;
    border: 2px dashed $main-yellow;
    padding: 15px;
    margin: 0 auto 20px;
    color: $white;
  }
}
.reviews__image {
    margin-right: 20px;
    clip-path: polygon(48% 0, 100% 25%, 100% 77%, 52% 100%, 0 76%, 0 27%);
}
@import "../assets/styles/_media.scss";
</style>